Hi @tkent , I've tried to reproduce this issue with following procedure get the same error:

1. Create a resource group named `zjhe-17493`
2. Create the following code file:

```hcl
provider "azurerm" {
  features {}
}

variable "resource_group_name" {
  type        = string
  description = "The associated resource group id for module resources"
}

variable "env_key" {
  type        = string
  description = "The environment key"
}

terraform {
  required_providers {
    azurerm = {
      version = ">=3.12.0, < 4.0.0"
    }
    random = {
      version = ">=2.2.0"
    }
  }
}

resource "random_string" "deploy_token" {
  length  = 8
  special = false
  upper   = false
  lower   = true
  numeric = true
}

data "azurerm_resource_group" "rg" {
  name = var.resource_group_name
}

data "azurerm_client_config" "current" {}

locals {
  location     =  data.azurerm_resource_group.rg.location
  deploy_token = random_string.deploy_token.result
}

resource "azurerm_key_vault" "kv" {
  name                        = "${var.env_key}${local.deploy_token}"
  location                    = local.location
  resource_group_name         = data.azurerm_resource_group.rg.name
  enabled_for_disk_encryption = true
  tenant_id                   = data.azurerm_client_config.current.tenant_id
  soft_delete_retention_days  = 7
  purge_protection_enabled    = false
  sku_name                    = "standard"
}
```

3. Execute `terraform plan -var env_key="thisisalongenv" -var resource_group_name="zjhe-17493"`:

```text
data.azurerm_client_config.current: Reading...
data.azurerm_resource_group.rg: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=2022-07-06 01:51:27.0911878 +0000 UTC]
data.azurerm_resource_group.rg: Read complete after 1s [id=/subscriptions/85b3dbca-5974-4067-9669-67a141095a76/resourceGroups/zjhe-17493]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy               = (known after apply)
      + enabled_for_disk_encryption = true
      + id                          = (known after apply)
      + location                    = "eastus"
      + name                        = (known after apply)
      + purge_protection_enabled    = false
      + resource_group_name         = "zjhe-17493"
      + sku_name                    = "standard"
      + soft_delete_retention_days  = 7
      + tenant_id                   = "72f988bf-86f1-41af-91ab-2d7cd011db47"
      + vault_uri                   = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # random_string.deploy_token will be created
  + resource "random_string" "deploy_token" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────── 

```

I think maybe you'll need to check your `var.env_key` value.